Revit 2027 API
ExternalServiceOptions Constructor
 Constructs a new ExternalServiceOptions with default settings.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalServiceOptions()
Public Sub New
public:
ExternalServiceOptions()
new : unit -> ExternalServiceOptions
See Also
Reference
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace